### A Pluto.jl notebook ###
# v0.19.9

using Markdown
using InteractiveUtils

# ╔═╡ 99389c33-1165-4f25-9798-2b39484a76e8
md"# Практическая работа №2"

# ╔═╡ 6b60694a-6f7a-4edd-86ec-a782d427fdcd
md"### Задача 1"

# ╔═╡ 38cd8cdb-9b8b-483d-be03-97bf68925d6e
md"##### **Задание**: вычислить максимальную энергию, которую могут иметь электроны в меди при абсолютном нуле (энергию Ферми). Принять, что на каждый атом меди приходится по одному электрону."

# ╔═╡ cc505b4b-6efc-45f6-9331-858f58717846
md">Введем плотность и молярную массу меди, число Авогадро, массу электрона, постоянную Дирака"

# ╔═╡ 835b9e3f-30f8-420a-bb16-e6ef286c8bbd
begin
	ρCu = 8.94 # kg/m^3
	MCu = 63.546e-3 # kg/mol
	NA = 6.02214e-23 # mol^-1
	mE = 9.1093837e-31 # kg
	hD = 1.054e-34 # J*s
end;

# ╔═╡ d839158d-2dd7-4543-a8d1-dcebae415517
md">Выразим концентрацию электронов через плотность и молярную массу ``n=\frac{N}{V}=\frac{\mu N_A}{V}=\frac{mN_A}{MV}=\frac{\rho N_A}{M}``"

# ╔═╡ 376e45a2-1b93-4be2-90a8-a0b66ebb7b41
nCu = ρCu*NA/MCu;

# ╔═╡ fe76b86e-ee5c-4023-a66f-278bf91fdac5
md">Найдем энергию Ферми по формуле ``E_F=\frac{\hbar}{2m}(3\frac{\rho N_A}{M\pi^2})^{\frac{2}{3}}``"

# ╔═╡ ea42af9b-dc14-45ad-817b-fe1221552b76
EFCu = 6.242e18*(hD/(2*mE)*(3*(ρCu*NA/(MCu*pi^2)))^(2/3)); # -> eV

# ╔═╡ 500734c9-dded-4250-8669-fa8190eacbc2
md"###### **Ответ**: рассчитанная энергия Ферми равна $EFCu эВ."

# ╔═╡ 4b71aa7b-ba3c-447d-bddd-e8c259c08d55
md"### Задача 2"

# ╔═╡ 429ad6d2-7975-40ad-a99e-96fac79d7a32
md"##### **Задание**: рассчитать кинетическую энергию электрона, находящегося в состоянии с максимальной энергией, в металлическом натрии, рассчитать его максимальную скорость."

# ╔═╡ 975e4fec-0a5d-4e6e-be2e-ee56eff9cc49
md">Введем плотность натрия"

# ╔═╡ a8e622db-0dd5-47d2-af9c-15441b553952
ρNa = 9.7e-5; # kg/m^3

# ╔═╡ 1dce9670-2a01-45ac-9a39-d621b13a1693
md">Максимальная кинетическая энергия равна энергии Ферми. Найдем ее по аналогии с задачей 1"

# ╔═╡ d902fb24-312f-49a1-a5f3-bc3810e0677c
Wmax = hD/(2*mE)*(3*(ρCu*NA/(MCu*pi^2)))^(2/3); # J

# ╔═╡ 14860a87-d40a-4a1f-8385-0a8d6ac1e9f8
md">Найдем максимальную скорость по формуле ``v_{max}=\sqrt{\frac{2W_{max}}{m}}``"

# ╔═╡ 75a322f0-6a42-4bf3-bfbd-68202a8211a1
vmax = sqrt(2*Wmax/mE); # m/s

# ╔═╡ c36efcab-58e6-49da-8f78-ffb116ec6eef
WmaxEV = Wmax*6.242e18; # -> eV

# ╔═╡ 2dec3d99-1d82-47d7-b1b9-67eb3fe9ed42
md"###### **Ответ**: рассчитанная кинетическая энергия равна $WmaxEV эВ, скорость $vmax м/с."

# ╔═╡ f41f9f92-ad60-4e62-b8e8-ae6bc89fa169
md"### Задача 3"

# ╔═╡ d6158847-ee6f-410a-9eeb-9b3836a4fdb0
md"##### **Задание**: рассчитать вероятность заполнения электронами в металле энергетического уровня, расположенного на 0.01 эВ ниже уровня Ферми при температуре 18°С."

# ╔═╡ 398c35c2-513b-4d8f-9dd5-3273918a9460
md">Воспользуемся статистикой Ферми-Дирака ``f_e(E)=\frac{1}{\exp(\frac{\Delta E}{k_BT})+1}``"

# ╔═╡ 9433ffca-2e78-4d84-bde0-2b781a47c120
kB = 1.38e-23;

# ╔═╡ 89799be0-1c4b-4cda-a24d-d6fc3f75f4cc
ΔE = -0.01/6.242e18; # -> J

# ╔═╡ 670881d4-fe59-476f-94ae-79b4d4176fec
T = 300-18;

# ╔═╡ 7ca2dcad-5e8f-4a95-8aca-cb0ede8a97d2
prob = 1/(exp(ΔE/(kB*T))+1);

# ╔═╡ adbb5e51-0c98-4496-b044-4a52daf55b9c
md"###### **Ответ**: рассчитанная вероятность равна $prob."

# ╔═╡ a59aa458-0e58-4a5c-8fc4-4d529a7b4d88
md"### Задача 4"

# ╔═╡ f99c7456-ee4b-4842-8588-c4adf229b4fc
md"##### **Задание**: как и во сколько раз изменится вероятность заполнения электронами энергетического уровня в металле, если уровень расположен на 0.01 эВ ниже уровня Ферми и температура изменяется от 200К до 300К?"

# ╔═╡ 9a101d94-10e9-43fc-9c01-221a73d1112f
md"Введем функцию вероятности в статистике Ферми-Дирака"

# ╔═╡ fe5d8afc-7d21-4f31-a6b8-3e70106ac3d0
 pr(ΔE, T) = 1/(exp(ΔE/(kB*T))+1);

# ╔═╡ da781646-e06b-4c6b-b8e4-1453e8155553
md"Оценим изменение следующим соотношением"

# ╔═╡ dc48a3f0-c0ca-4105-9c6d-410d01f32e38
ch = pr(ΔE,200)/pr(ΔE,300)

# ╔═╡ 674cf8cd-7028-4d7b-8042-a305d7d0aa74
md"###### **Ответ**: вероятность увеличится на 7.6%."

# ╔═╡ 00000000-0000-0000-0000-000000000001
PLUTO_PROJECT_TOML_CONTENTS = """
[deps]
"""

# ╔═╡ 00000000-0000-0000-0000-000000000002
PLUTO_MANIFEST_TOML_CONTENTS = """
# This file is machine-generated - editing it directly is not advised

julia_version = "1.8.2"
manifest_format = "2.0"
project_hash = "da39a3ee5e6b4b0d3255bfef95601890afd80709"

[deps]
"""

# ╔═╡ Cell order:
# ╟─99389c33-1165-4f25-9798-2b39484a76e8
# ╟─6b60694a-6f7a-4edd-86ec-a782d427fdcd
# ╟─38cd8cdb-9b8b-483d-be03-97bf68925d6e
# ╟─cc505b4b-6efc-45f6-9331-858f58717846
# ╠═835b9e3f-30f8-420a-bb16-e6ef286c8bbd
# ╟─d839158d-2dd7-4543-a8d1-dcebae415517
# ╠═376e45a2-1b93-4be2-90a8-a0b66ebb7b41
# ╟─fe76b86e-ee5c-4023-a66f-278bf91fdac5
# ╠═ea42af9b-dc14-45ad-817b-fe1221552b76
# ╟─500734c9-dded-4250-8669-fa8190eacbc2
# ╟─4b71aa7b-ba3c-447d-bddd-e8c259c08d55
# ╟─429ad6d2-7975-40ad-a99e-96fac79d7a32
# ╟─975e4fec-0a5d-4e6e-be2e-ee56eff9cc49
# ╠═a8e622db-0dd5-47d2-af9c-15441b553952
# ╟─1dce9670-2a01-45ac-9a39-d621b13a1693
# ╠═d902fb24-312f-49a1-a5f3-bc3810e0677c
# ╟─14860a87-d40a-4a1f-8385-0a8d6ac1e9f8
# ╠═75a322f0-6a42-4bf3-bfbd-68202a8211a1
# ╠═c36efcab-58e6-49da-8f78-ffb116ec6eef
# ╟─2dec3d99-1d82-47d7-b1b9-67eb3fe9ed42
# ╟─f41f9f92-ad60-4e62-b8e8-ae6bc89fa169
# ╟─d6158847-ee6f-410a-9eeb-9b3836a4fdb0
# ╟─398c35c2-513b-4d8f-9dd5-3273918a9460
# ╠═9433ffca-2e78-4d84-bde0-2b781a47c120
# ╠═89799be0-1c4b-4cda-a24d-d6fc3f75f4cc
# ╠═670881d4-fe59-476f-94ae-79b4d4176fec
# ╠═7ca2dcad-5e8f-4a95-8aca-cb0ede8a97d2
# ╟─adbb5e51-0c98-4496-b044-4a52daf55b9c
# ╟─a59aa458-0e58-4a5c-8fc4-4d529a7b4d88
# ╟─f99c7456-ee4b-4842-8588-c4adf229b4fc
# ╟─9a101d94-10e9-43fc-9c01-221a73d1112f
# ╠═fe5d8afc-7d21-4f31-a6b8-3e70106ac3d0
# ╟─da781646-e06b-4c6b-b8e4-1453e8155553
# ╠═dc48a3f0-c0ca-4105-9c6d-410d01f32e38
# ╟─674cf8cd-7028-4d7b-8042-a305d7d0aa74
# ╟─00000000-0000-0000-0000-000000000001
# ╟─00000000-0000-0000-0000-000000000002
